---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator
source: html/743ee1f7-722e-0de6-87a6-9785522df4bb.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator

An iterator to a correction factor set.

## Syntax (C#)
```csharp
public abstract class CorrectionFactorSetIterator : APIObject,
	IEnumerator
```